Repository: kageroumado/adrafinil
Catalog: Adrafinil/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: %@ [Releases page.](https://github.com/kageroumado/adrafinil/releases)
zh_hans: %@[前往发布页面。](https://github.com/kageroumado/adrafinil/releases)

source: %@ may not be tracked
zh_hans: %@ 可能未被跟踪

source: %@'s Adrafinil hook isn't in the form Adrafinil expects — likely edited by hand or left over from an update — so it may not notice when %@ is working and keep your Mac awake. Reconnect restores it without touching your other %@ settings.
zh_hans: %1$@ 的 Adrafinil 钩子与 Adrafinil 预期的格式不符——可能被手动编辑过，或是更新后遗留的——因此可能无法察觉 %2$@ 何时在工作并让你的 Mac 保持唤醒。重新连接会恢复它，不会改动你的其他 %3$@ 设置。

source: %@'s settings file couldn't be read (it may contain comments or a syntax error). Adrafinil won't modify it in this state — fix the file, then try connecting again.
zh_hans: 无法读取 %@ 的设置文件（可能包含注释或语法错误）。在这种状态下 Adrafinil 不会修改它——请修复文件后再尝试连接。

source: %lld agents finished
zh_hans: %lld 个 Agent 已完成

source: %lld agents may not be tracked
zh_hans: %lld 个 Agent 可能未被跟踪

source: %lld agents working
zh_hans: %lld 个 Agent 正在工作

source: %lld holds
zh_hans: %lld 个唤醒锁

source: %lld still working
zh_hans: %lld 个仍在工作

source: %lld waiting on you
zh_hans: %lld 个在等你

source: <1m
zh_hans: <1分钟

source: A background helper
zh_hans: 一个后台助手

source: A backup to the per-agent setup: while Adrafinil is already keeping your Mac awake for one agent, it can also notice other known agents (like a second Claude Code) running without their hook installed. It only runs while an agent is already active — never a background scan — so it costs nothing while your Mac is idle or asleep.
zh_hans: 这是逐个 Agent 设置的后备方案：当 Adrafinil 已在为某个 Agent 保持 Mac 唤醒时，它还能留意到其他未安装钩子但正在运行的已知 Agent（比如第二个 Claude Code）。它只在已有 Agent 活跃时运行——从不在后台扫描——因此 Mac 空闲或睡眠时没有任何开销。

source: A display hold is active but the lid is closed with no other display — the agent behind it can't see the screen.
zh_hans: 显示器唤醒锁已启用，但盖子已合上且没有其他显示器——发起它的 Agent 看不到屏幕。

source: A menu bar app
zh_hans: 一个菜单栏 App

source: A newer version of Adrafinil is out. See what's new and install it.
zh_hans: Adrafinil 有新版本了。查看新功能并安装。

source: A newer version of Adrafinil is ready when you are.
zh_hans: Adrafinil 的新版本已就绪，随时可以安装。

source: A question, a plan approval, or a permission prompt stops the work until you answer — but the question can be answered from your phone with Remote Control, which needs the Mac awake to receive it. The grace period keeps it reachable exactly that long; if nobody answers, your Mac sleeps, and the moment the session resumes Adrafinil protects it again. The menu shows a countdown while it waits.
zh_hans: 提问、计划审批或权限请求会让工作暂停，直到你回答——但你可以通过 Remote Control 在手机上回答，这需要 Mac 保持唤醒才能接收。宽限期会让 Mac 在这段时间内保持可连接；如果无人回答，Mac 就会睡眠，而会话一旦恢复，Adrafinil 会立即再次保护它。等待期间，菜单中会显示倒计时。

source: About
zh_hans: 关于

source: Add these to your agent's start and stop hooks. Replace %@ with your agent's session-id variable, so each turn's acquire and release share a key.
zh_hans: 将这些添加到 Agent 的开始和停止钩子中。把 %@ 替换为 Agent 的会话 ID 变量，让每轮的 acquire 和 release 使用同一个键。

source: Add your own agent
zh_hans: 添加你自己的 Agent

source: Adds Adrafinil as an MCP tool in %@, so it can keep your Mac awake for work that runs past its reply.
zh_hans: 将 Adrafinil 作为 MCP 工具添加到 %@，让它能在回复结束后为仍在运行的工作保持 Mac 唤醒。

source: Adds Adrafinil as an MCP tool in %@, so the agent can keep your Mac awake for work that runs past its reply.
zh_hans: 将 Adrafinil 作为 MCP 工具添加到 %@，让该 Agent 能在回复结束后为仍在运行的工作保持 Mac 唤醒。

source: Adrafinil Setup
zh_hans: Adrafinil 设置向导

source: Adrafinil checks GitHub Releases once a day and tells you here and in the menu when a new version is out. Nothing downloads or installs until you choose Update Now.
zh_hans: Adrafinil 每天检查一次 GitHub Releases，有新版本时会在这里和菜单中告诉你。在你选择“立即更新”之前，不会下载或安装任何内容。

source: Adrafinil checks GitHub Releases once a day and verifies every download's code signature. Updates install themselves when your Mac is idle and no agents are being kept awake — or right away with Update Now.
zh_hans: Adrafinil 每天检查一次 GitHub Releases，并验证每个下载的代码签名。更新会在你的 Mac 空闲且没有 Agent 需要保持唤醒时自动安装——也可以点按“立即更新”马上安装。

source: Adrafinil chime
zh_hans: Adrafinil 提示音

source: Adrafinil couldn't clean up everywhere — remove these by hand, or the agent will keep calling a command that no longer exists: %@
zh_hans: Adrafinil 未能清理所有位置——请手动移除以下内容，否则 Agent 会一直调用一个已不存在的命令： %@

source: Adrafinil cue
zh_hans: Adrafinil 提示音

source: Adrafinil is running from a temporary location (macOS translocation). Setting up from here would point everything at a path that disappears on the next launch. Move Adrafinil.app to your Applications folder, then open it again.
zh_hans: Adrafinil 正在从临时位置运行（macOS 路径随机化）。从这里设置会让所有配置指向一个下次启动时就会消失的路径。请将 Adrafinil.app 移到“应用程序”文件夹，然后重新打开。

source: Adrafinil is set up
zh_hans: Adrafinil 已设置完成

source: Adrafinil isn't keeping your Mac awake
zh_hans: Adrafinil 没有在让你的 Mac 保持唤醒

source: Adrafinil isn't set up
zh_hans: Adrafinil 尚未设置

source: Adrafinil keeps it awake while your agents work — a desktop still sleeps on idle and would stall a long task. Lid and battery features are hidden because there's no lid or battery to manage.
zh_hans: Adrafinil 会在你的 Agent 工作时让它保持唤醒——台式机空闲时仍会睡眠，可能会中断长时间的任务。由于没有盖子或电池需要管理，相关功能已隐藏。

source: Adrafinil keeps your Mac awake — even with the lid closed — while your AI agents work.
zh_hans: 在你的 AI Agent 工作时，Adrafinil 会让你的 Mac 保持唤醒——即使合上盖子也一样。

source: Adrafinil kept your Mac awake
zh_hans: Adrafinil 让你的 Mac 保持了唤醒

source: Adrafinil let it sleep to cool down (it peaked at %lld°C). %@
zh_hans: Adrafinil 让它进入睡眠以降温（最高达到 %lld°C）。%@

source: Adrafinil let it sleep to cool down. %@
zh_hans: Adrafinil 让它进入睡眠以降温。%@

source: Adrafinil let your Mac sleep to save power. %@
zh_hans: Adrafinil 让你的 Mac 进入睡眠以节省电量。%@

source: Adrafinil needs your approval
zh_hans: Adrafinil 需要你的批准

source: Adrafinil updated itself at a quiet moment — here's what changed.
zh_hans: Adrafinil 已在空闲时自动更新——以下是更改内容。

source: Adrafinil updated itself at a quiet moment. See what's new.
zh_hans: Adrafinil 已在空闲时自动更新。查看新功能。

source: Adrafinil's background helper didn't respond in time.
zh_hans: Adrafinil 的后台助手未及时响应。

source: Adrafinil's background helper sent an unexpected response.
zh_hans: Adrafinil 的后台助手返回了意外的响应。

source: Adrafinil's helper isn't responding
zh_hans: Adrafinil 的助手没有响应

source: Adrafinil's helper stopped
zh_hans: Adrafinil 的助手已停止

source: Agent holds
zh_hans: Agent 唤醒锁

source: Agent name
zh_hans: Agent 名称

source: Agents
zh_hans: Agent

source: Agents can't keep your Mac awake until you resume
zh_hans: 在你恢复之前，Agent 无法让你的 Mac 保持唤醒

source: Agents finished
zh_hans: Agent 已完成

source: Agents that run as one shared background service, like Hermes, aren't picked up this way — connect them in the Agents tab so their hooks can signal when they're actually working.
zh_hans: 以共享后台服务形式运行的 Agent（如 Hermes）无法通过这种方式发现——请在“Agent”标签页中连接它们，让它们的钩子告知何时真正在工作。

source: All set — Codex will keep your Mac awake while it works.
zh_hans: 一切就绪——Codex 工作时会让你的 Mac 保持唤醒。

source: An agent can ask Adrafinil to keep your Mac awake for a background task it started — like a long build or deploy — even after it finishes replying. Every hold has a time limit and shows up in the menu, where you can end it yourself.
zh_hans: Agent 可以请求 Adrafinil 为它启动的后台任务（比如耗时的构建或部署）保持 Mac 唤醒，即使它已结束回复。每个唤醒锁都有时间上限，并显示在菜单中，你可以在那里自行结束它。

source: Approve Adrafinil's two hooks
zh_hans: 批准 Adrafinil 的两个钩子

source: Back to presets
zh_hans: 返回预设

source: Background shell tasks
zh_hans: 后台 Shell 任务

source: Battery was running low
zh_hans: 电池电量不足

source: CPU temperature is unreadable, so the thermal cutout can't trigger.
zh_hans: 无法读取 CPU 温度，因此过热保护无法触发。

source: Can't verify — trust it in Codex
zh_hans: 无法验证——请在 Codex 中信任

source: Cancel
zh_hans: 取消

source: Check for updates
zh_hans: 检查更新

source: Checking for updates…
zh_hans: 正在检查更新…

source: Codex needs you to trust its hooks
zh_hans: Codex 需要你信任它的钩子

source: Codex only runs hooks you've approved. Until you trust Adrafinil's, Codex won't tell it when a turn starts or ends — so your Mac may sleep mid-task, or stay awake after Codex is done.
zh_hans: Codex 只会运行你批准过的钩子。在你信任 Adrafinil 的钩子之前，Codex 不会告诉它一轮对话何时开始或结束——你的 Mac 可能会在任务中途睡眠，或在 Codex 完成后仍保持唤醒。

source: Codex won't run these hooks until you trust them. Open Codex, run “/hooks”, and approve Adrafinil's acquire and release entries — otherwise it can't tell when Codex is working.
zh_hans: 在你信任这些钩子之前，Codex 不会运行它们。打开 Codex，运行“/hooks”，并批准 Adrafinil 的 acquire 和 release 条目——否则它无法得知 Codex 何时在工作。

source: Config unreadable
zh_hans: 配置无法读取

source: Connect each agent so Adrafinil knows when it's working and keeps your Mac awake only then. Some agents can also keep it awake on their own — for a build or deploy that runs past their reply. You can change all of this later in Settings.
zh_hans: 连接每个 Agent，让 Adrafinil 知道它何时在工作，并仅在那时让你的 Mac 保持唤醒。有些 Agent 还能自行保持唤醒——用于在回复结束后仍在运行的构建或部署。这些都可以稍后在“设置”中更改。

source: Connect your agents
zh_hans: 连接你的 Agent

source: Connected
zh_hans: 已连接

source: Connecting your agents…
zh_hans: 正在连接你的 Agent…

source: Consider quiet after
zh_hans: 视为无响应的时间

source: Continue
zh_hans: 继续

source: Copy to clipboard
zh_hans: 拷贝到剪贴板

source: Copy “/hooks”
zh_hans: 拷贝“/hooks”

source: Couldn't download the update. Check your connection, or get it from the releases page.
zh_hans: 无法下载更新。请检查网络连接，或从发布页面获取。

source: Couldn't load the release notes.
zh_hans: 无法载入更新说明。

source: Couldn't reach Adrafinil's background helper.
zh_hans: 无法连接 Adrafinil 的后台助手。

source: Couldn't repair Adrafinil automatically
zh_hans: 无法自动修复 Adrafinil

source: Custom agents aren't auto-detected or watched, so pair every acquire with a reliable release — the idle-release timeout and each hold's time limit are the only safety net if one is missed. Snippets assume the %@ command is on your PATH (%@, or %@).
zh_hans: 自定义 Agent 不会被自动检测或监视，因此每次 acquire 都要搭配可靠的 release——如果漏掉了，空闲释放超时和每个唤醒锁的时间上限就是仅有的保障。代码片段假定 %1$@ 命令位于你的 PATH 中（%2$@ 或 %3$@）。

source: Custom duration
zh_hans: 自定时长

source: Disconnects Adrafinil from every agent, turns off its background services, removes the adrafinil command, and deletes its settings — then quits.
zh_hans: 断开 Adrafinil 与所有 Agent 的连接，关闭其后台服务，移除 adrafinil 命令并删除其设置——然后退出。

source: Done
zh_hans: 完成

source: Finding agents
zh_hans: 发现 Agent

source: Force sleep when CPU temperature is too high
zh_hans: CPU 温度过高时强制睡眠

source: Force sleep when battery runs low (on battery, lid closed)
zh_hans: 电量过低时强制睡眠（使用电池且已合盖时）

source: General
zh_hans: 通用

source: Grace period
zh_hans: 宽限期

source: Hear this sound
zh_hans: 试听此声音

source: Hold expired
zh_hans: 唤醒锁到期

source: Hooks trusted
zh_hans: 钩子已信任

source: How to trust
zh_hans: 如何信任

source: Idle agents
zh_hans: 空闲的 Agent

source: If an agent does nothing for a while, Adrafinil stops keeping your Mac awake for it — so a stuck or crashed agent can't hold it up forever.
zh_hans: 如果某个 Agent 一段时间没有任何活动，Adrafinil 就不再为它保持 Mac 唤醒——这样卡住或崩溃的 Agent 就不会让 Mac 一直无法睡眠。

source: Install
zh_hans: 安装

source: Install one of the supported agents, then connect it any time from Settings → Agents.
zh_hans: 安装一个受支持的 Agent，然后随时在“设置”→“Agent”中连接它。

source: Install updates automatically
zh_hans: 自动安装更新

source: Integration style
zh_hans: 集成方式

source: It has hooks / events
zh_hans: 它有钩子 / 事件

source: It has no hooks — wrap the command
zh_hans: 它没有钩子——包装命令

source: It needs your approval to run in the background. Tap to open Login Items & Extensions, then turn Adrafinil on.
zh_hans: 它需要你批准才能在后台运行。轻点以打开“登录项与扩展”，然后打开 Adrafinil。

source: It now lives in your menu bar. Close the lid while an agent is working — your Mac stays awake. No agent running? Sleep behaves normally.
zh_hans: 它现在位于菜单栏中。在 Agent 工作时合上盖子，你的 Mac 会保持唤醒。没有 Agent 在运行？睡眠一切照常。

source: It will install itself when your Mac is idle and no agents are working.
zh_hans: 它会在你的 Mac 空闲且没有 Agent 工作时自动安装。

source: It's fully open source —
zh_hans: 它完全开源——

source: Its Adrafinil hook changed, so your Mac might not stay awake while it works. Open Settings to reconnect.
zh_hans: 它的 Adrafinil 钩子已更改，因此它工作时你的 Mac 可能不会保持唤醒。打开“设置”以重新连接。

source: Its background service isn't registered, so it can't keep your Mac awake. Repair it to register it again.
zh_hans: 它的后台服务未注册，因此无法让你的 Mac 保持唤醒。修复以重新注册。

source: Its background service isn't responding. Repair it to re-register and bring it back.
zh_hans: 它的后台服务没有响应。修复以重新注册并恢复它。

source: Its background service isn't set up. Tap to finish setting up Adrafinil.
zh_hans: 它的后台服务尚未设置。轻点以完成 Adrafinil 的设置。

source: Its background service stopped responding and couldn't repair itself. Tap to open Login Items & Extensions, remove Adrafinil, then reopen it.
zh_hans: 它的后台服务已停止响应，且无法自行修复。轻点以打开“登录项与扩展”，移除 Adrafinil，然后重新打开它。

source: Keep awake
zh_hans: 保持唤醒

source: Keep awake until you turn it off
zh_hans: 保持唤醒，直到你关闭

source: Keep the Mac awake for background shell commands
zh_hans: 为后台 Shell 命令保持 Mac 唤醒

source: Keep the Mac awake for them too
zh_hans: 同样为它们保持 Mac 唤醒

source: Keep your Mac awake
zh_hans: 让 Mac 保持唤醒

source: Keep your Mac awake for a set time
zh_hans: 让 Mac 在设定的时间内保持唤醒

source: Keep your Mac awake only while AI agents are working.
zh_hans: 只在 AI Agent 工作时让你的 Mac 保持唤醒。

source: Keeping your Mac awake
zh_hans: 正在让你的 Mac 保持唤醒

source: Keeps your Mac awake while agents work. Registered as a login service so it's ready after a restart.
zh_hans: 在 Agent 工作时让你的 Mac 保持唤醒。它会注册为登录服务，重启后即可使用。

source: Kept awake by you
zh_hans: 由你保持唤醒

source: Later
zh_hans: 稍后

source: Launch at login
zh_hans: 登录时启动

source: Let agents keep your Mac awake on their own
zh_hans: 允许 Agent 自行让 Mac 保持唤醒

source: Let it keep your Mac awake on its own
zh_hans: 允许它自行让 Mac 保持唤醒

source: Let it sleep
zh_hans: 让它睡眠

source: Let it sleep right away
zh_hans: 立即睡眠

source: Lets your agents tell Adrafinil when they start and stop working.
zh_hans: 让你的 Agent 告诉 Adrafinil 它们何时开始和停止工作。

source: Lid closed
zh_hans: 已合盖

source: Lock the screen when you close the lid
zh_hans: 合上盖子时锁定屏幕

source: Longest a hold can last
zh_hans: 唤醒锁最长持续时间

source: Low-battery cutout
zh_hans: 低电量保护

source: MIT License · © 2026 kageroumado
zh_hans: MIT 许可证 · © 2026 kageroumado

source: Move Adrafinil to Applications first
zh_hans: 请先将 Adrafinil 移到“应用程序”文件夹

source: Needs reconnect
zh_hans: 需要重新连接

source: No agents active — close the lid and your Mac sleeps
zh_hans: 没有活跃的 Agent——合上盖子，Mac 就会睡眠

source: No agents active — your Mac sleeps when idle
zh_hans: 没有活跃的 Agent——Mac 空闲时会睡眠

source: No agents were running.
zh_hans: 没有 Agent 在运行。

source: No hooks? Wrap the command so it stays awake for the whole run — or place a single timed hold for a background job.
zh_hans: 没有钩子？包装命令，让 Mac 在整个运行期间保持唤醒——或为后台任务放置一个定时唤醒锁。

source: No supported agents detected.
zh_hans: 未检测到支持的 Agent。

source: No supported agents found yet
zh_hans: 尚未找到支持的 Agent

source: Not trusted yet
zh_hans: 尚未信任

source: Notice other agents while one is active
zh_hans: 有 Agent 活跃时留意其他 Agent

source: Notifications are turned off for Adrafinil in System Settings, so the “while you were away” recap won't appear after you reopen the lid.
zh_hans: Adrafinil 的通知已在“系统设置”中关闭，因此重新打开盖子后不会显示“你离开期间”的摘要。

source: Off
zh_hans: 关闭

source: On start / prompt
zh_hans: 开始时 / 提交提示词时

source: On stop / finish
zh_hans: 停止时 / 完成时

source: One quick approval
zh_hans: 只需一次批准

source: One-shot hold
zh_hans: 一次性唤醒锁

source: Open Codex in your terminal
zh_hans: 在终端中打开 Codex

source: Open Login Items
zh_hans: 打开登录项

source: Open Login Items & Extensions, switch Adrafinil off and remove it with the “–” button, then reopen the app — or try repairing once more.
zh_hans: 打开“登录项与扩展”，关闭 Adrafinil 并用“–”按钮将其移除，然后重新打开 App——或者再试一次修复。

source: Open setup again…
zh_hans: 重新打开设置向导…

source: Partly trusted — approve both
zh_hans: 部分信任——请批准两个

source: Pause Adrafinil — your Mac sleeps normally until you resume.
zh_hans: 暂停 Adrafinil——在你恢复之前，Mac 会正常睡眠。

source: Paused
zh_hans: 已暂停

source: Play a sound before your Mac goes back to sleep
zh_hans: Mac 恢复睡眠前播放声音

source: Play a sound when you close the lid
zh_hans: 合上盖子时播放声音

source: Quit Adrafinil
zh_hans: 退出 Adrafinil

source: Quit Adrafinil?
zh_hans: 要退出 Adrafinil 吗？

source: Quit Anyway
zh_hans: 仍然退出

source: Re-check
zh_hans: 重新检查

source: Re-registering its background services and checking they respond.
zh_hans: 正在重新注册后台服务并检查它们是否响应。

source: Read them on GitHub
zh_hans: 在 GitHub 上阅读

source: Reconnect
zh_hans: 重新连接

source: Registering…
zh_hans: 正在注册…

source: Release this hold — let the Mac sleep normally
zh_hans: 释放此唤醒锁——让 Mac 正常睡眠

source: Released by you
zh_hans: 由你释放

source: Reopens the guided setup. Use it to connect a new agent, or to fix one that shows “Needs reconnect”.
zh_hans: 重新打开设置向导。可用来连接新的 Agent，或修复显示“需要重新连接”的 Agent。

source: Repair
zh_hans: 修复

source: Repair Again
zh_hans: 再次修复

source: Repairing Adrafinil…
zh_hans: 正在修复 Adrafinil…

source: Resume Adrafinil — let agents keep your Mac awake again.
zh_hans: 恢复 Adrafinil——让 Agent 再次保持 Mac 唤醒。

source: Retry
zh_hans: 重试

source: Run the /hooks command
zh_hans: 运行 /hooks 命令

source: Safety
zh_hans: 安全

source: Safety cutout
zh_hans: 安全保护

source: Safety cutouts are active (overheating and low battery) — acquires are paused until conditions recover or the lid opens.
zh_hans: 安全保护已启用（过热且电量不足）——在条件恢复或打开盖子之前，暂停接受新的唤醒请求。

source: Settings
zh_hans: 设置

source: Settings…
zh_hans: 设置…

source: Setup couldn't register a background service
zh_hans: 设置无法注册后台服务

source: Show %@'s settings file in Finder
zh_hans: 在访达中显示 %@ 的设置文件

source: Show in menu bar
zh_hans: 在菜单栏中显示

source: Skip
zh_hans: 跳过

source: Sleep after a grace period
zh_hans: 宽限期后睡眠

source: Sleeping normally
zh_hans: 正常睡眠

source: Some hooks need manual cleanup
zh_hans: 部分钩子需要手动清理

source: Sound
zh_hans: 声音

source: Start a Codex session where you'd normally use it.
zh_hans: 在你平时使用 Codex 的地方开始一个会话。

source: Start keeping awake
zh_hans: 开始保持唤醒

source: Stop waiting on agents that go quiet
zh_hans: 不再等待无响应的 Agent

source: System Settings → Login Items & Extensions just opened. Turn **Adrafinil** on under “Allow in the Background,” then come back and click Continue.
zh_hans: “系统设置”→“登录项与扩展”已经打开。在“允许在后台”下打开 **Adrafinil**，然后回到这里点按“继续”。

source: The %@ command
zh_hans: %@ 命令

source: The controls you're looking at now — its window opens from the menu bar.
zh_hans: 就是你现在看到的这些控件——它的窗口从菜单栏打开。

source: The low-battery cutout fired — acquires are paused until charging resumes or the lid opens.
zh_hans: 低电量保护已触发——在恢复充电或打开盖子之前，暂停接受新的唤醒请求。

source: The sleep block couldn't be fully applied — your Mac may still sleep when the lid closes. Retrying.
zh_hans: 无法完全阻止睡眠——合上盖子时 Mac 仍可能睡眠。正在重试。

source: The thermal cutout fired — acquires are paused until the Mac cools down or the lid opens.
zh_hans: 过热保护已触发——在 Mac 降温或打开盖子之前，暂停接受新的唤醒请求。

source: The update couldn't be installed. Try again, or get it from the releases page.
zh_hans: 无法安装更新。请重试，或从发布页面获取。

source: Their Adrafinil hooks changed, so your Mac might not stay awake while they work. Open Settings to reconnect.
zh_hans: 它们的 Adrafinil 钩子已更改，因此它们工作时你的 Mac 可能不会保持唤醒。打开“设置”以重新连接。

source: Thermal cutout
zh_hans: 过热保护

source: These apply when an agent is still working as you close the lid — a sound to confirm your Mac is staying awake, and a locked screen to keep it private.
zh_hans: 这些设置在你合上盖子时仍有 Agent 在工作的情况下生效——用声音确认 Mac 保持唤醒，并锁定屏幕以保护隐私。

source: This disconnects Adrafinil from all your agents, turns off its background services, and removes the adrafinil command and its settings. This can't be undone.
zh_hans: 这将断开 Adrafinil 与你所有 Agent 的连接，关闭其后台服务，并移除 adrafinil 命令及其设置。此操作无法撤销。

source: This looks like a desktop Mac
zh_hans: 这似乎是一台台式 Mac

source: This release shipped without notes.
zh_hans: 此版本没有附带更新说明。

source: Threshold
zh_hans: 阈值

source: Tracked as %@ in Adrafinil
zh_hans: 在 Adrafinil 中显示为 %@

source: Trust Adrafinil in Codex
zh_hans: 在 Codex 中信任 Adrafinil

source: Trust the entries that run **adrafinil acquire** (on prompt submit) and **adrafinil release** (on stop). They're listed under your hooks file; approving each is a one-time step.
zh_hans: 信任运行 **adrafinil acquire**（提交提示词时）和 **adrafinil release**（停止时）的条目。它们列在你的钩子文件下，每个只需批准一次。

source: Turn Adrafinil on under “Allow in the Background” so it can keep your Mac awake while agents work. If it won't turn on, try Repair.
zh_hans: 在“允许在后台”下打开 Adrafinil，让它能在 Agent 工作时保持 Mac 唤醒。如果无法打开，请尝试修复。

source: Turn an agent on and Adrafinil keeps your Mac awake while it's working, then lets it sleep again when the agent stops. Turn it off to disconnect. Some agents can also keep your Mac awake on their own — that adds Adrafinil as an MCP tool they can call.
zh_hans: 打开某个 Agent 后，Adrafinil 会在它工作时让你的 Mac 保持唤醒，并在它停止后让 Mac 恢复睡眠。关闭即可断开连接。有些 Agent 还能自行让 Mac 保持唤醒——这会将 Adrafinil 添加为它们可以调用的 MCP 工具。

source: Type
zh_hans: 输入

source: Uninstall Adrafinil?
zh_hans: 要卸载 Adrafinil 吗？

source: Uninstall and Quit
zh_hans: 卸载并退出

source: Uninstall and quit…
zh_hans: 卸载并退出…

source: Until you approve them in Codex with /hooks, your Mac won't stay awake while Codex works. Open Settings for the steps.
zh_hans: 在你于 Codex 中用 /hooks 批准它们之前，Codex 工作时你的 Mac 不会保持唤醒。打开“设置”查看步骤。

source: Update Now
zh_hans: 立即更新

source: Update available — %@
zh_hans: 有可用更新——%@

source: Update to %@ Now
zh_hans: 立即更新到 %@

source: Updated to %@
zh_hans: 已更新到 %@

source: Updates
zh_hans: 更新

source: Updating…
zh_hans: 正在更新…

source: Version %@
zh_hans: 版本 %@

source: Version %@ is downloaded and verified — it installs at a quiet moment, when your Mac is idle and no agents are being kept awake.
zh_hans: 版本 %@ 已下载并验证——它会在空闲时安装，即你的 Mac 处于空闲且没有 Agent 需要保持唤醒时。

source: View on GitHub
zh_hans: 在 GitHub 上查看

source: Volume
zh_hans: 音量

source: Waiting for you — %@
zh_hans: 正在等你——%@

source: Waiting for your answer
zh_hans: 正在等待你的回答

source: Welcome to Adrafinil
zh_hans: 欢迎使用 Adrafinil

source: What gets set up
zh_hans: 将要设置的内容

source: What's New
zh_hans: 新功能

source: What's New…
zh_hans: 新功能…

source: What's new in %@
zh_hans: %@ 的新功能

source: When Claude Code asks you something
zh_hans: 当 Claude Code 向你提问时

source: When an agent runs a shell command in the background — a long build or test run it keeps going after replying — this keeps your Mac awake for it. There's no signal when such a command finishes, so the hold lasts up to your longest-hold limit above (even if the task itself goes quiet, like a “tail -f”) and then ends on its own. Works with Claude Code. Off by default.
zh_hans: 当 Agent 在后台运行 Shell 命令（比如在回复后仍继续运行的耗时构建或测试）时，此选项会为其保持 Mac 唤醒。这类命令结束时不会发出信号，因此唤醒锁会持续到上方设置的最长时间（即使任务本身已无输出，比如“tail -f”），然后自动结束。适用于 Claude Code。默认关闭。

source: When sleep resumes
zh_hans: 恢复睡眠时

source: When the last agent finishes while the lid is closed, Adrafinil plays a cue just before your Mac goes back to sleep — so you know it's done without opening the lid. Each reason can have its own sound; the volume above applies.
zh_hans: 合盖期间最后一个 Agent 完成时，Adrafinil 会在 Mac 恢复睡眠前播放提示音——无需打开盖子就知道已经完成。每种原因可以设置各自的声音，音量沿用上方的设置。

source: When you close the lid
zh_hans: 合上盖子时

source: While it waits
zh_hans: 等待期间

source: With the icon hidden, Adrafinil keeps running in the background. Reopen it from Spotlight or Finder to bring its menu back as a window.
zh_hans: 隐藏图标后，Adrafinil 会继续在后台运行。从“聚焦”或“访达”重新打开它，即可将菜单以窗口形式调出。

source: Working…
zh_hans: 正在处理…

source: Wrapper script
zh_hans: 包装脚本

source: You're up to date
zh_hans: 已是最新版本

source: Your Mac can sleep again
zh_hans: 你的 Mac 可以再次睡眠

source: Your Mac goes back to sleeping normally and agents stop being tracked until you open it again.
zh_hans: 你的 Mac 将恢复正常睡眠，在你再次打开 Adrafinil 之前不会跟踪 Agent。

source: Your Mac was getting hot
zh_hans: 你的 Mac 温度过高

source: Your Mac will stay awake
zh_hans: 你的 Mac 将保持唤醒

source: Your agents
zh_hans: 你的 Agent

source: and press return.
zh_hans: 然后按下 Return 键。

source: view it on GitHub
zh_hans: 在 GitHub 上查看
